<?php

echo '<div   class="wrapper">';

echo '<link rel="stylesheet" href="style.css">';


echo '<p> 1. Написать функцию которая по параметрам принимает число из десятичной системы счисления и 
преобразовывает в двоичную.  <br> Написать функцию которая выполняет преобразование наоборот. </p>';
echo ' <a href="dz1_1.php">   dz1_1.php  </a>';

echo '<p> 2. Написать функцию которая выводит первые N чисел фибоначчи </p>';
echo ' <a href="dz1_2.php">   dz1_2.php  </a>';

echo '<p> 3. Написать функцию, возведения числа N в степень M </p>';
echo ' <a href="dz1_3.php">   dz1_3.php  </a>';

echo '<p> 4. Написать функцию которая вычисляет входит ли IP-адрес в диапазон указанных IP-адресов. Вычислить для версии ipv4. </p>';
echo ' <a href="dz1_4.php">   dz1_4.php  </a>';



echo '</div>';
