<?php

echo '<div   class="wrapper">';

echo '<link rel="stylesheet" href="style.css">';

echo '<h1> Дз 1 </h1>';

echo '<p> 1. Написать функцию которая по параметрам принимает число из десятичной системы счисления и 
преобразовывает в двоичную.  <br> Написать функцию которая выполняет преобразование наоборот. </p>';
echo ' <a href="dz1_1.php">   dz1_1.php  </a>';

echo '<p> 2. Написать функцию которая выводит первые N чисел фибоначчи </p>';
echo ' <a href="dz1_2.php">   dz1_2.php  </a>';

echo '<p> 3. Написать функцию, возведения числа N в степень M </p>';
echo ' <a href="dz1_3.php">   dz1_3.php  </a>';

echo '<p> 4. Написать функцию которая вычисляет входит ли IP-адрес в диапазон указанных IP-адресов. Вычислить для версии ipv4. </p>';
echo ' <a href="dz1_4.php">   dz1_4.php  </a>';

echo '<p> 5. Для одномерного массива
<br> - Подсчитать процентное соотношение положительных/отрицательных/нулевых/простых чисел
<br> - Отсортировать элементы по возрастанию/убыванию
 </p>';
echo ' <a href="dz1_5.php">   dz1_5.php  </a>';

echo '<p> 6. Для двумерных массивов
 <br> - Транспонировать матрицу
 <br> - Сложить две матрицы
 <br> - Удалить те строки, в которых сумма элементов положительна и присутствует хотя бы один нулевой элемент. Аналогично для столбцов.
  </p>';
echo ' <a href="dz1_6.php">   dz1_6.php  </a>';

echo '<p> 7. Рекурсии
  <br> - Все задачи на циклы которые можно реализовать с помощью рекурсии, переписать с помощью рекурсивных функций
  <br> - Написать рекурсивную функцию которая будет обходить и выводить все значения любого массива и любого уровня вложенности
   </p>';
echo ' <a href="dz1_7.php">   dz1_7.php  </a>';

//*************************************** */

echo '<h1> Дз 2 </h1>';

echo '<p>1. В заданиях из первого домашнего задания, 
<br> где необходима обработка и проверка на корректность входных данных,
<br>  обработать с помощью исключительных ситуаций.
 </p>';
echo ' <a href="dz2_1.php">   dz2_1.php  </a>';



echo '<p>2. Создать класс “Фигура” унаследовать от него три класса “Прямоугольник”, “Треугольник” и “Круг”. 
<br> Посчитать периметр и площадь фигуры. Объяснить на примере суть полиморфизма. 
<br> Некорректные входные данные, обработать исключительными ситуациями. 
<br> Нарисовать UML-диаграмму классов (интерфейсов).
 </p>';
echo ' <a href="dz2_2.php">   dz2_2.php  </a>';



echo '<br> <br>';

echo '</div>';
